#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//********************************************************************
//********************************************************************
// 
//题目： 一瓶汽水一元，两个空瓶子可以换一瓶汽水，则n元可以喝多少瓶汽水
// 
//********************************************************************
//********************************************************************


//*****************************************
//               函数递归1
//*****************************************

int cqg = 0;//转换的重要变量！！！存钱罐
int heqishui1(int n)
{
	int ret = n;//ret为喝的汽水瓶，此后n则为空瓶
	if (n >= 1)
	{
//      如果空瓶是奇数个，则可以换(n-1)/2瓶汽水，剩余一个空瓶存入cqg，
//      等下一次还是奇数个空瓶时加上存入的空瓶一起换汽水
		if (n % 2 == 1 && cqg == 0)//奇数时存一个空瓶
		{
			n--;
			cqg++;
		}
		if (n % 2 == 1 && cqg == 1)//奇数时将存入空瓶取出
		{
			n++;
			cqg--;
		}
		n /= 2;
		return heqishui1(n) + ret;
	}
	return 0;
}
//*****************************************
//               函数递归2
//*****************************************

int heqishui2(int n,int empty)
{
	int ret = n;//ret为喝的汽水瓶数，此后n表示汽水数
//  先得知道空瓶是否多于一个，因此只能先在函数参数中加上空瓶参数，
//  如果直接用n来代替if中的条件则在接下来的递归中n其实并不一定是
//  空瓶数，因为换完汽水后可能还有空瓶
	if (empty > 1)
	{
		int tmp = empty;
		empty = empty / 2 + empty % 2;//这里必须是空瓶除以2，不能是empty=n/2+n%2
		n = tmp / 2 ;//n为可换的汽水数，不能是n/=2
		return heqishui2(n,empty) + ret;
	}
	else
	{
		return 1;
	}
}
int main()
{
	int n = 0;
	int money = 0;
	printf("请输入一瓶汽水的价钱：");
	scanf("%d", &money);
	printf("请输入花多少钱买汽水：");
	scanf("%d", &n);
	n = n / money;
	int t1 = heqishui1(n);//n为汽水数，然后函数直接计算出最后可以喝的瓶数
	int t2 = heqishui2(n,n);//第一个n为买的汽水瓶数，第二个为第一次喝完后的空瓶数
	printf("%d\n", t1);
	printf("%d\n", t2);
	return 0;
}


//***************************************
//           普通喝汽水
//***************************************
//int main()
//{
//	int money = 0;
//	int empty = 0;
//	int total = 0;
//	scanf("%d", &money);
//	total = money;
//	empty = money;
//	while (empty>1)
//	{
//		total += empty / 2;
//		empty = empty / 2 + empty % 2;
//	}
//	printf("%d", total);
//	return 0;
//}